koson/rtthread_acquisition/bsp/stm32f10x/drivers/usart.c
static const struct rt_uart_ops stm32_uart_ops =
{
    stm32_configure,
    stm32_control,
    stm32_putc,
    stm32_getc,
    stm32_dma_transmit,
};

#if defined(RT_USING_UART1)
/* UART1 device driver structure */
struct stm32_uart uart1 =
{
    USART1,
    USART1_IRQn,
    {
        DMA1_Channel5,
        DMA1_Channel4,
        DMA1_FLAG_GL5,
        DMA1_FLAG_GL4,
        DMA1_Channel5_IRQn,
		DMA1_Channel4_IRQn,
        0,
    },
};
struct rt_serial_device serial1;

#include "global.h"

void USART1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&serial1);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel5_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial1);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel4_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(&serial1);
    DMA_ClearFlag(DMA1_FLAG_GL4);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART1 */

#if defined(RT_USING_UART2)
/* UART2 device driver structure */
struct stm32_uart uart2 =
{
    USART2,
    USART2_IRQn,
    {
        DMA1_Channel6,
        DMA1_Channel7,
        DMA1_FLAG_GL6,
        DMA1_FLAG_GL7,
        DMA1_Channel6_IRQn,
        DMA1_Channel7_IRQn,
        0,
    },
};
struct rt_serial_device serial2;

void USART2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

     if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
     {
         if(USART_GetFlagStatus(USART2, USART_FLAG_PE) == RESET)
         {
             uart_rx_check_data(&uart2_rx, (USART2->DR & 0xff));
         }
         /* clear interrupt */
         USART_ClearITPendingBit(USART2, USART_IT_RXNE);
     }

    uart_isr(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel7_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel6_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

//    dma_rx_done_isr(&serial1);
    DMA_ClearFlag(DMA1_FLAG_GL6);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART2 */

#if defined(RT_USING_UART3)
/* UART3 device driver structure */
struct stm32_uart uart3 =
{
    USART3,
    USART3_IRQn,
    {
        DMA1_Channel3,
        DMA1_Channel2,
        DMA1_FLAG_GL3,
        DMA1_FLAG_GL2,
        DMA1_Channel3_IRQn,
        DMA1_Channel2_IRQn,
        0,
    },
};
struct rt_serial_device serial3;

void USART3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
    {
        if(USART_GetFlagStatus(USART3, USART_FLAG_PE) == RESET)
        {
            uart_rx_check_data(&uart3_rx, (USART3->DR & 0xff));
        }
        /* clear interrupt */
        USART_ClearITPendingBit(USART3, USART_IT_RXNE);
    }

    uart_isr(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel3_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA1_Channel2_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

//    dma_rx_done_isr(&serial1);
    DMA_ClearFlag(DMA1_FLAG_GL2);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART3 */

#if defined(RT_USING_UART4)
/* UART4 device driver structure */
struct stm32_uart uart4 =
{
    UART4,
    UART4_IRQn,
    {
        DMA2_Channel3,
        DMA2_Channel5,
        DMA2_FLAG_GL3,
        DMA2_FLAG_GL5,
        DMA2_Channel3_IRQn,
        DMA2_Channel4_5_IRQn,
        0,
    },
};
struct rt_serial_device serial4;

void UART4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    if(USART_GetITStatus(UART4, USART_IT_RXNE) != RESET)
    {
        if(USART_GetFlagStatus(UART4, USART_FLAG_PE) == RESET)
        {
            uart_rx_check_data(&uart4_rx, (UART4->DR & 0xff));
        }
        /* clear interrupt */
        USART_ClearITPendingBit(UART4, USART_IT_RXNE);
    }

    uart_isr(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA2_Channel3_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}

void DMA2_Channel4_5_IRQHandler(void) {
    /* enter interrupt */
    rt_interrupt_enter();

//    dma_rx_done_isr(&serial1);
    DMA_ClearFlag(DMA2_FLAG_GL5);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART4 */

#if defined(RT_USING_UART5)
/* UART5 device driver structure */
struct stm32_uart uart5 =
{
    UART5,
    UART5_IRQn,
    {
        0,
        0,
        0,
        0,
        0,
        0,
        0,
    },
};
struct rt_serial_device serial5;

void UART5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    if(USART_GetITStatus(UART5, USART_IT_RXNE) != RESET)
    {
        if(USART_GetFlagStatus(UART5, USART_FLAG_PE) == RESET)
        {
            uart_rx_check_data(&uart5_rx, (UART5->DR & 0xff));
        }
        /* clear interrupt */
        USART_ClearITPendingBit(UART5, USART_IT_RXNE);
    }

    uart_isr(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* RT_USING_UART5 */

static void RCC_Configuration(void)
{
#if defined(RT_USING_UART1)
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);
    /* Enable UART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
#endif /* RT_USING_UART1 */

#if defined(RT_USING_UART2)
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);
    /* Enable UART clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
#endif /* RT_USING_UART2 */

